dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
	 /* GPIO Periph clock enable */
	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC | RCC_AHBPeriph_GPIOF, ENABLE);
 /* UART1 Clock enable; SPI1 Clock enable*/
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_SPI1,ENABLE);


/*
 * Outputs:
 * PA2 - Digit 0, COL1 (klaviatura)
 * PA1 - Digit 1, COL2 (klaviatura)
 * PA0 - Digit 2, COL3 (klaviatura)
 *
 * PA13 - BAR1 (Group)
 * PA14 - BAR2 (Group)
 *
 *
 * PB2,PB1 - a , BAR1
 * PC6,PC7 - b , BAR8
 * PC4,PB15 - c , BAR3
 * PF5,PB14 - d , BAR5
 * PF4, PA3 - e , BAR6
 * PB13,PB12 - f , BAR7
 * PB0,PC5 - g , BAR2
 * PC15,PF0 - DP , BAR4
 *
 *
 *    A
 *  F   B
 *    G
 *  E   C
 *    D
 *        DP
 *
 * PA12, PA11 - BAR9, AquaFresh(1,2),
 * PA8, PC10 - BAR10, AquaFresh(1,2)
 *
 * PC8 - Lamp 1
 * PC9 - Lamp 2
 * PB5 - Auqa fresh
 * PC14 - Ventilator 2
 * PB4 - Ventilator 1
 *
 * PC13 - STBY of amplifier
 *
 * SPECIAL FUNCTIONS:
 *
 * PB6 - I2C2_SDA_0 - Left input
 * PB7 - I2C2_SCL_0
 * PB11 - I2C2_SDA_1 - Right input
 * PB10 - I2C2_SCL_1
 * PF7 - I2C2_SDA_2 - Left internal
 * PF6 - I2C2_SCL_2
 * PB8 -  I2C_SCL_3 - Right internal
 * PB9 -  I2C_SDA_3
 *
 *
 * PA15 - SPI1_NSS
 * PA7 - MISO
 * PA6 - MOSI
 * PA5 - SPI_CLK
 *
 * PA4 - DAC_OUT
 *
 *
 * INPUTS:
 * PC11 - ROW1 - klaviatura
 * PC12 - ROW2 - klaviatura
 * PD2  - ROW3 - klaviatura
 *
 *
 */
	  /*
	   *
	   * */

	  /* Configure PA in output push-pull mode (for segments)*/
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_8 | GPIO_Pin_11| GPIO_Pin_12 ; // LATER!| GPIO_Pin_13 | GPIO_Pin_14;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOA, &GPIO_InitStructure);

	  /* Configure PB in output push-pull mode (for segments  )*/
//	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2  | GPIO_Pin_4  | GPIO_Pin_5 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2  |  GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	  /* Configure PC in output push-pull mode (for segments )*/
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5 | GPIO_Pin_6|GPIO_Pin_7 | GPIO_Pin_13;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOC, &GPIO_InitStructure);

	  /* Configure PF4 in output push-pull mode (for segments )*/
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_4|GPIO_Pin_5;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOF, &GPIO_InitStructure);


//	  //Configure SPI pins:   ----------------------------
//	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 ;
//	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//	  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
//	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
//	  GPIO_Init(GPIOA, &GPIO_InitStructure);

	  //Configure SPI pins:   ----------------------------
	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 ;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOB, &GPIO_InitStructure);



//	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource15, GPIO_AF_0); // SPI1_NSS
//	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_0); // MISO
//	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_0); // MOSI
//	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_0); // SPI_CLK

	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource4, GPIO_AF_0); // MISO
	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource5, GPIO_AF_0); // MOSI
	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource3, GPIO_AF_0); // SPI_CLK

	  //Configure USART2 pins:  Rx and Tx ----------------------------
//	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6 | GPIO_Pin_7;
//	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
//	  GPIO_Init(GPIOB, &GPIO_InitStructure);

//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_0); // USART1_TX
//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_0); // USART1_RX
//
//	  USART_InitStructure.USART_BaudRate = 1200;
//	  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
//	  USART_InitStructure.USART_StopBits = USART_StopBits_1;
//	  USART_InitStructure.USART_Parity = USART_Parity_No;
//	  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
//	  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
//	  USART_Init(USART1, &USART_InitStructure);
//	  USART_InvPinCmd(USART1,USART_InvPin_Tx,ENABLE);
//
//	  USART_Cmd(USART1,ENABLE);
	  {
		  uint16_t tmpreg = SPI1->CR1;

//		  SPI_StructInit(&SPI_InitStruct);
		  memset(&SPI_InitStruct, 0, sizeof(SPI_InitStruct));
		  SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
		  SPI_InitStruct.SPI_Mode = SPI_Mode_Master;
		  SPI_InitStruct.SPI_DataSize = SPI_DataSize_16b;
		  SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;
		  SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;
		  SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;
		  SPI_InitStruct.SPI_NSS = SPI_NSS_Soft;
		  SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;

		  SPI_Init(SPI1,&SPI_InitStruct);

		  SPI_Cmd(SPI1, ENABLE);
	  }
	  while(1){
		  unsigned int k;

		  long long int i;
		  SPI_I2S_SendData16(SPI1, 0x0001<<k);
		  SPI_I2S_SendData16(SPI1, 0x0001<<(k - 15));
		  for (i = 0; i< 565530; i++){
			  i = i +1;
		  }
		  GPIOC->BSRR = GPIO_BSRR_BS_13; // Trigger latch

		  for (i = 0; i< 565530; i++){
			  i = i + 1;
		  }
		  GPIOC->BRR = GPIO_BSRR_BS_13;
//		  if(k&1){
//			  GPIOA->BSRR = GPIO_BSRR_BS_6; // Trigger data
//		  }else GPIOA->BRR = GPIO_BSRR_BS_6;
		  k++;
		  if(k>40) k = 0;
	  }



	  GPIOC->BSRR = GPIO_BSRR_BS_13; // Trigger latch

